In [22]:
import pandas as pd

df = pd.read_csv("sample_data.csv")
df

   order_id customer  amount     category       city
0       101    Alice    1200  Electronics      Delhi
1       102      Bob     800     Clothing     Mumbai
2       103  Charlie    1500  Electronics  Bangalore
3       104    Alice     700     Clothing      Delhi
4       105      Bob    2000  Electronics     Mumbai

In [23]:
df.head()
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  5 non-null      int64
 1   customer  5 non-null      object
 2   amount    5 non-null      int64
 3   category  5 non-null      object
 4   city      5 non-null      object
dtypes: int64(2), object(3)
memory usage: 332.0+ bytes

         order_id       amount
count    5.000000     5.000000
mean   103.000000  1240.000000
std      1.581139   531.977443
min    101.000000   700.000000
25%    102.000000   800.000000
50%    103.000000  1200.000000
75%    104.000000  1500.000000
max    105.000000  2000.000000

4 rows 
5 columns 
coulum 0 and 2 to be int  
all data for the data frame(df)can be obtained via

In [24]:
df["amount"]
df[["customer", "amount"]]

  customer  amount
0    Alice    1200
1      Bob     800
2  Charlie    1500
3    Alice     700
4      Bob    2000

In [26]:
# filtering df
df[df["amount"]>1000]
df[df["category"]=="Electronics"]
df[(df["city"]=="Delhi")&(df["amount"]>1000)]

   order_id customer  amount     category   city
0       101    Alice    1200  Electronics  Delhi

In [39]:
#Sorting df
df.sort_values("amount")
df.sort_values("amount", ascending=False)
df.sort_index()

   order_id customer  amount     category       city
0       101    Alice    1200  Electronics      Delhi
1       102      Bob     800     Clothing     Mumbai
2       103  Charlie    1500  Electronics  Bangalore
3       104    Alice     700     Clothing      Delhi
4       105      Bob    2000  Electronics     Mumbai

# Which customer spent the most overall 
df.groupby("customer")["amount"].sum().idxmax()
# Which city has highest total sales 
df.groupby("city")["amount"].sum().idxmax() 
# How many electronics orders exist 
df[df["category"]=="Electronics"].shape[0] also df["category"].value_counts()["Electronics"]